Revit 2027 API
PrintManager.PaperSizes Property
Get all print sizes of current printer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PaperSizeSet PaperSizes { get; }
Public ReadOnly Property PaperSizes As PaperSizeSet
	Get
public:
property PaperSizeSet^ PaperSizes {
	PaperSizeSet^ get ();
}
member PaperSizes : PaperSizeSet with get
Property Value
PaperSizeSet
Remarks
These are the valid paper sizes for the current printer.
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace